<template>
	<main class="page">
		<div class="screen">
			<Background />
			<div class="screen__container">
				<Logo />
				<div class="screen__body">
					<Doves />
					<div class="screen__content">
						<ul class="screen__text">
							<li>Корпус коренастый и короткий, клинообразно сужающийся к хвосту, расположен почти горизонтально.</li>
							<li>Хвост короткий, узкий, выходящий за пределы крыльев примерно на 20 мм.</li>
							<li>Ноги сильные, средней длины, неоперённые, нижняя половина голени голая. Плюсны красные, когти той же окраски, что и клюв.</li>
							<li>Перьевой покров густой, гладкий и прилегающий.</li>
							<li>
								Цвета и рисунки оперения немецких выставочных голубей разнообразны: встречаются птицы с чёрными или белыми поясами, синие без поясов, синие с
								крапчатыми щитками, с тёмным крапом, темночешуйные, красные, красные с крапом и чешуйные, жёлтые, жёлтые с крапом и чешуйные, серые (цвета
								жаворонка) палевые с чёрными, коричневыми или жёлтыми поясами, чисто-белые с чернью, в крапинку и сизоватые, тигровые, пятнистые и другие. Особо
								ценятся пегие расцветки гомеров. Если цветных и белых перьев у птицы немного, то пегим его не назовут.
							</li>
							<li>
								Крупные дефекты: грубая, шероховатая, нетипичная голова, неуклюжая, слишком большая и тяжёлая, а иногда маленькая, низкая или слишком высокая
								фигура; гранная голова; кадык, как у багдета; несомкнутый клюв; белые, жёлтые, бесцветные глаза; красные окологлазные кольца; слишком большие
								восковицы; горловая складка; кучерявость и белая спина.
							</li>
						</ul>
					</div>
					<Navigation :page-next="pageNext" :page-prev="pagePrev" />
				</div>
			</div>
		</div>
	</main>
</template>

<script setup>
import Navigation from '@/components/Navigation';
import Background from '@/components/Background';
import Logo from '@/components/Logo';
import Doves from '@/components/Doves';
import { onMounted } from 'vue';
import store from '@/store/index';

const pagePrev = 'page-4';
const pageNext = 'page-6';

onMounted(() => {
	store.dispatch('animate');
});
</script>
