<template>
    <PageIndex :page-next="pageNext" :page-prev="pagePrev">
        <h2 class="screen__subtitle">Выставочная порода</h2>
        <div class="screen__content">
            <p class="screen__text">Один из главных признаков породы – праздничный внешний вид.</p>
            <p class="screen__text">Птица должна выглядеть как сильный летун.</p>
            <p class="screen__text">
                Выставки обычно проводятся зимой или в начале марта, после племенного периода, чтобы не навредить
                будущему потомству. Учитывают и период линьки. В это
                время птиц подкармливают добавками, которые увеличивают интенсивность цвета перьев и блеск. Например,
                голубям с жёлтым окрасом, добавляют в корм
                кукурузу. Для того, чтобы выглядеть красиво, птица должна перелинять полностью.
            </p>
            <p class="screen__text">Основные породные признаки:</p>
            <ul class="screen__text">
                <li>горизонтальная стойка;</li>
                <li>тонкий прямой профиль;</li>
                <li>широкое расстояние между глазами;</li>
                <li>пропорциональное, выраженное телосложение;</li>
                <li>гладкое оперение, плотно прилегающее к туловищу.</li>
            </ul>
            <p class="screen__text">
                У сизых и чёрных голубей клюв тёмного цвета, а у цветастых и светлых – рогового. Окрас должен быть
                чётким и равномерным, пояса - узкими, интенсивно
                окрашенными. Основной цвет должен покрывать всё тело голубя.
            </p>
        </div>
    </PageIndex>
</template>

<script setup>
import PageIndex from '@/views/PageIndex.vue';

const pagePrev = 'page-6';
const pageNext = 'home';
</script>