<template>
	<main class="page">
		<div class="screen">
			<Background />
			<div class="screen__container">
				<Logo />
				<div class="screen__body">
					<Doves />
					<h2 class="screen__subtitle">Внешний вид</h2>
					<div class="screen__content">
						<p class="screen__text">По внешним признакам – это благородный, коренастый голубь с густым и гладким оперением.</p>
						<ul class="screen__text">
							<li>
								Голова между глазами широкая, ко лбу и клюву клинообразно сужается. Клюв и лоб образуют правильную низкую дугу, переходящую в выпуклую голову и
								закруглённый затылок. Тонко очерченный и характерный для данной породы профиль не должен быть нарушен.
							</li>
							<li>
								Клюв средней длины, широкий у основания, гармонично пропорциональный, выпуклый, тупой и хорошо смыкающийся. Продолженная линия рассека клюва делит
								глаз примерно пополам. Клюв чёрный, у красных и жёлтых разновидностей он рогового цвета.
							</li>
							<li>
								Восковицы нежные, к клюву прилегают крепко и гладко, без выступа, не нарушая линию профиля. Они продолговатые, как бы напудренные, сердцевидной
								формы.
							</li>
							<li>
								Глаза большие, чуть выпуклые и очень выразительные, блестящего тёмно-красного цвета, у белых голубей — тёмные, а у пёстрых - в зависимости от
								преобладающего в окраске оперения головы цвета - тёмно-красные или тёмные.
							</li>
							<li>Окологлазные кольца узкие, развиты равномерно, нежные, сероватые, с белым налётом.</li>
							<li>
								Шея средней длины широко сидит на плечах, по направлению к голове слегка сужается, держит её голубь гордо. Красиво округлённое горло без горловой
								складки и типичного для багдетов кадыка.
							</li>
							<li>Грудь широкая и выпуклая, короткая и округлая, но не производит впечатление массивности или неуклюжести.</li>
						</ul>
					</div>
					<Navigation :page-next="pageNext" :page-prev="pagePrev" />
				</div>
			</div>
		</div>
	</main>
</template>

<script>
import { mapActions } from 'vuex';
import Navigation from '@/components/Navigation';
import Doves from '@/components/Doves';
import Logo from '@/components/Logo';
import Background from '@/components/Background';

export default {
	name: 'Page-4',
	data() {
		return {
			pagePrev: 'page-3',
			pageNext: 'page-5',
		};
	},
	components: {
		Doves,
		Logo,
		Background,
		Navigation,
	},
	mounted() {
		this.animate();
	},
	methods: {
		...mapActions(['animate']),
	},
};
</script>
